{"sections":{"page-sections-1":{"type":"page-sections-1","disabled":true,"settings":{"container":"medium"}},"image_banner_MCFF6Q":{"type":"image-banner","blocks":{"slide_P6AAWx":{"type":"slide","settings":{"image_desktop":"shopify:\/\/shop_images\/RanchFlyover_1.png","image_mobile":"shopify:\/\/shop_images\/RanchFlyover_1_1.png","image_alignment":"center","show_logo_icon":true,"enable_overlay":true,"title":"About Booth Creek"}}},"block_order":["slide_P6AAWx"],"settings":{"enable_smooth_scrolling":false,"speed_smooth_scrolling":3000,"delay_smooth_scrolling":5000,"mob_image_height":"257"}},"text_grid_columns_k3LhYj":{"type":"text-grid-columns","blocks":{"text_mrbdHA":{"type":"text","settings":{"title":"5,000","desc":"<p>acres of land on the ranch.<\/p>"}},"text_wJnFL6":{"type":"text","settings":{"title":"25","desc":"<p>miles between the ranch and processing center.<\/p>"}},"text_4YaQym":{"type":"text","settings":{"title":"20","desc":"<p>miles from processing to distribution center.<\/p>"}}},"block_order":["text_mrbdHA","text_wJnFL6","text_4YaQym"],"settings":{"bg_color":"#e0d3b4","title":"","link_title":"Learn more","link":""}},"image_width_text_vertical_VHDkRc":{"type":"image-width-text-vertical","settings":{"title":"Our ranch","text":"<p>Located north of Manhattan, Kansas, Booth Creek Wagyu Ranch is anything but flat – despite what most people think about our state's geography. The land features deep, wooded creek draws, surrounded by rolling hills of lush tallgrass prairie, making for the perfect place to raise our special herd of Wagyu cattle. <\/p><p>It all began in 2020, when our founder, Dave Dreiling, attended his first Wagyu auction. After studying the Wagyu industry in America, he saw opportunities to improve the industry through efficiency, education, and a more practical business approach. Thus Booth Creek, a one-of-a-kind, vertically integrated Wagyu beef company, was born. <\/p>","image":"shopify:\/\/shop_images\/b2c8177a67f2f416c81d8d6074a9eefd.png","image_margin_top":-10}},"about_us_content_AYbtne":{"type":"about-us-content","settings":{"title":"Our Butchers","text":"<p>We say we are a vertical Wagyu beef company, but what does that mean? Booth Creek owns the entire process, starting from our Ranch, to our specialized Wagyu feeding program at Wagyu Feeders Inc., to our processing plant, Meatworks of Kansas, to our retail locations and distribution center. <\/p><p>Adding to our unique business structure, our butchers not only specialize in the processing of Wagyu, that is all we do. Meatworks of Kansas is a well-established and respected provider of custom Wagyu beef processing and purveying services.<\/p><p>All staff have been trained extensively by a fourth generation Wagyu butcher, resulting in the ability to provide cuts many other processors won’t.<\/p>","image":"shopify:\/\/shop_images\/4a0eb994c158662263bd996f241433f9.jpg","title_2":"Our Wagyu","text_2":"<p>But why Booth Creek for your Wagyu needs? Besides owning the entire farm to fork process, all our facilities are within a 30-mile radius of each other. This makes for some of the freshest and finest Wagyu you can find in America! Serving you quality beef is our highest priority, which is why we have worked tirelessly to open four retail locations in our home state of Kansas. <\/p><p>Don’t worry if you don’t live close to the Flint Hills, our distribution center is hard at work providing the best for our customers in the lower 48 states. <\/p><p>With a team of Wagyu experts handling orders and providing top-notch customer service through various communication channels, we are here to take care of all your questions and needs.<\/p><p>Much has changed since that first cattle auction, but our founding principle hasn’t. We’re here to elevate America’s standard of quality beef.<\/p>"}},"best_sellers_eJ6HxQ":{"type":"best-sellers","settings":{"title":"our best sellers","collection":"steak","products_limit":4,"link_title":"","link":"","bg_color":"","show_bg_image":true,"minimize_mobile_version":true}}},"order":["page-sections-1","image_banner_MCFF6Q","text_grid_columns_k3LhYj","image_width_text_vertical_VHDkRc","about_us_content_AYbtne","best_sellers_eJ6HxQ"]}